-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Feb 19, 2025 at 03:52 PM
-- Server version: 10.4.32-MariaDB
-- PHP Version: 8.1.25

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `shop_db`
--

-- --------------------------------------------------------

--
-- Table structure for table `products`
--

CREATE TABLE `products` (
  `id` int(100) NOT NULL,
  `name` varchar(100) NOT NULL,
  `category` varchar(20) NOT NULL,
  `details` varchar(500) NOT NULL,
  `price` int(100) NOT NULL,
  `image` varchar(100) NOT NULL,
  `stock` int(150) NOT NULL,
  `size` varchar(30) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `products`
--

INSERT INTO `products` (`id`, `name`, `category`, `details`, `price`, `image`, `stock`, `size`) VALUES
(34, 'คอลเกต ยาสีฟัน โททอล ชาร์โคล ดีพ คลีน 150 กรัม', '1', 'ยาสีฟันคอลเกตโททอลชาร์โคลดีพคลีน ปกป้องแบคทีเรียได้ยาวนาน12ชั่วโมง เพื่อสุขภาพช่องปากที่ดีขึ้น ช่วยปกป้องแบคทีเรียบริเวณฟัน เหงือก กระพุ้งแก้ม และลิ้น ยาสีฟันคอลเกตโททอลชาร์โคลดีพคลีน ปกป้องแบคทีเรียได้ยาวนาน12ชั่วโมง เพื่อสุขภาพช่องปากที่ดีขึ้น ช่วยปกป้องแบคทีเรียบริเวณฟัน เหงือก กระพุ้งแก้ม และลิ้น ยาสีฟันคอลเกตโททอลชาร์โคลดีพคลีน ปกป้องแบคทีเรียได้ยาวนาน12ชั่วโมง เพื่อสุขภาพช่องปากที่ดีขึ้น ช่วยปกป้องแบคทีเรียบริเวณฟัน เหงือก กระพุ้งแก้ม และลิ้น ยาสีฟันคอลเกตโททอลชาร์โคลดีพคลีน ปกป้องแบคทีเรี', 118, 'Screenshot 2025-02-18 234559.png', 48, ''),
(35, 'โพรเทคส์ สบู่ก้อน ลาเวนเดอร์ ไอซ์ ฟรีซ 60 กรัม. สบู่โพรเทคส์ สบู่ก้อน', '1', 'โพรเทคส์ สบู่ ลาเวนเดอร์ ไอซ์ ฟรีซ สูตรเพื่อความเย็นสุดขั้ว พร้อมกลิ่นหอมผ่อนคลายจากลาเวนเดอร์ และช่วยลดแบคทีเรีย สาเหตุหนึ่งของกลิ่นกาย ผสานแฟลกซ์ซีดออยล์ ทำงานร่วมกับผิว ช่วยเสริมสร้างการปกป้องผิวจากแบคทีเรียตามธรรมชาติ ลดการสะสมของแบคทีเรีย 99.9 เพื่อสุขภาพผิวที่ดีของคุณ', 16, 'Screenshot 2025-02-18 235302.png', 28, ''),
(36, 'MEO (มี-โอ) แมวโต 7 กก. รสปลาทูน่า', '2', 'มีโอ อาหารแมว ชนิดเม็ด สำหรับแมวโต รสปลาทูน่า 7 กก. ​ ​\r\n\r\n\r\n\r\n✨ บำรุงขนและผิวหนังของแมว\r\n\r\n✨ มีคุณค่าทางโภชนาการที่สมบูรณ์และสมดุลสำหรับแมว\r\n\r\n✨ ทอรีนเป็นกรดอะมิโนที่จำเป็นต่อการทำงานของดวงตาอย่างเหมาะสมและบำรุงสายตาของแมว\r\n\r\n✨ วิตามินซีช่วยกระตุ้นระบบภูมิคุ้มกันของแมวและช่วยลดผลเสียของความเครียดต่อสุขภาพของแมว\r\n\r\n✨ แคลเซียม ฟอสฟอรัส และวิตามินดี ช่วยให้ฟันและกระดูกแข็งแรง\r\n\r\n✨ สูตรนี้พัฒนาขึ้นเพื่อช่วยป้องกันความเสี่ยงของ FLUTD (โรคทางเดินปัสสาวะส่วนล่างของแมว)\r\n\r\n✨ Omega-3 และ Omega-6 จากน้ำม', 400, 'Screenshot 2025-02-18 235552.png', 37, ''),
(39, 'Birdy Espresso Less Sugar ขนาด: 3 in 1 (แบบผงชง)', '3', 'าแฟสำเร็จรูปรสเอสเพรสโซ่ รสชาติกลมกล่อม ลดปริมาณน้ำตาล เหมาะสำหรับผู้ที่ชอบกาแฟรสเข้มข้นและมีความหวานน้อย', 100, 'images (4).jpg', 20, ''),
(41, 'ซันไลต์ น้ำยาล้างจาน กลิ่นมะนาว', '1', 'น้ำยาล้างจานที่ช่วยขจัดคราบมันและทำให้จานสะอาดได้อย่างมีประสิทธิภาพ พร้อมกลิ่นมะนาวสดชื่นที่ช่วยให้มีความหอมสะอาด', 20, 'ดาวน์โหลด (20).jpg', 28, ''),
(46, 'Mild ทิชชู่ม้วน 6 ม้วน', '1', 'ทิชชู่ม้วนเนื้อเนียนนุ่ม เหมาะสำหรับการใช้งานในบ้านหรือสำนักงาน ให้ความสะอาดและความนุ่มสบายในการใช้งาน', 50, 'images (7).jpg', 20, ''),
(47, 'Scott Clean Care ทิชชู่ม้วน 6 ม้วน', '1', 'ทิชชู่ม้วนที่มีความนุ่มและทนทาน สามารถใช้ได้หลายวัตถุประสงค์ เช่น ใช้ทำความสะอาดหรือดูแลสุขอนามัยในชีวิตประจำวัน', 80, 'ดาวน์โหลด (18).jpg', 15, ''),
(49, 'Coca-Cola กระป๋อง', '3', 'ครื่องดื่มน้ำอัดลมรสโคล่าที่มีรสชาติหวานและซ่าสดชื่น เป็นเครื่องดื่มยอดนิยมในหลายประเทศ เหมาะสำหรับการดื่มในช่วงเวลาต่างๆ', 15, '12313.jpg', 25, ''),
(50, 'Sprite กระป๋อง', '3', 'เครื่องดื่มน้ำอัดลมรสเลมอนที่มีความซ่าสดชื่น เหมาะสำหรับการดื่มในช่วงเวลาที่ต้องการความสดชื่นและการฟื้นฟู', 15, 'images (6).jpg', 22, ''),
(51, 'แฟนต้า กระป๋อง', '3', 'เครื่องดื่มน้ำอัดลมรสส้มที่มีรสชาติหวานสดชื่น เหมาะสำหรับการดื่มในช่วงเวลาต่างๆ เพื่อความสดชื่น', 15, 'images (2).jpg', 23, ''),
(52, 'แฟนต้า รสองุ่น', '3', 'เครื่องดื่มน้ำอัดลมรสองุ่นที่มีรสชาติหวานซ่าสดชื่น เหมาะสำหรับการดื่มในช่วงเวลาต่างๆ เพื่อเติมความสดชื่น', 20, 'images (5).jpg', 20, ''),
(53, 'Birdy 3 in 1 Espresso', '3', 'กาแฟสำเร็จรูป 3 in 1 รสเอสเพรสโซ่ สำหรับผู้ที่ชื่นชอบกาแฟรสเข้มข้น มีความหวานน้อย เหมาะสำหรับดื่มในทุกช่วงเวลา', 8, 'images (8).jpg', 40, ''),
(56, 'Moccona Trio 3 in 1', '3', 'กาแฟสำเร็จรูป 3 in 1 รสกาแฟเข้มข้นที่ผสมผสานความหอมของกาแฟและความหวานจากน้ำตาลอย่างลงตัว เหมาะสำหรับผู้ที่ชื่นชอบกาแฟที่สามารถชงได้ง่ายและสะดวก', 70, 'ดาวน์โหลด (8).jpg', 16, ''),
(57, 'Colgate Total 12 ยาสีฟัน', '1', 'ยาสีฟันที่ช่วยให้ช่องปากสะอาดและสดชื่นป้องกันฟันผุและแบคทีเรีย มีการป้องกันที่ยาวนานถึง 12 ชั่วโมง', 40, 'images.png', 26, ''),
(58, 'Pepsi กระป๋อง', '3', 'เครื่องดื่มน้ำอัดลมรสโคล่า ที่มีรสชาติหวานและซ่าสดชื่น เหมาะสำหรับการดื่มในช่วงเวลาต่างๆ', 15, 'ดาวน์โหลด.jpg', 22, ''),
(59, 'Bear Brand Prebio 3', '3', 'นมยูเอชทีที่มีส่วนผสมของ Prebio และ DHA ช่วยเสริมสร้างระบบภูมิคุ้มกันและพัฒนาการทางสมองสำหรับเด็กในวัย 3 ปีขึ้นไป', 30, 'images.jpg', 20, ''),
(60, 'บีทาเก้น ไลน์ นมเปรี้ยว', '3', 'นมเปรี้ยวสูตร 0% ไขมัน และสูตรน้ำตาล 2% ที่ไม่มีแลคโตส (Lactose Free) เหมาะสำหรับผู้ที่มีปัญหากับการย่อยแลคโตสหรือผู้ที่ดูแลสุขภาพ', 20, '4c1c0dcf63c2a7023f9f18e68acefe00.jpg', 24, ''),
(62, 'Pedigree อาหารสุนัข', '2', 'อาหารสุนัขสูตรครบถ้วนสำหรับสุนัขทุกขนาด ช่วยดูแลสุขภาพฟัน ขน และการย่อยอาหาร พร้อมคุณค่าทางโภชนาการที่จำเป็น', 160, 'ดาวน์โหลด (1).jpg', 14, ''),
(63, 'Perfecta Soft & Meaty Smoked Beef Flavor', '2', 'ขนมสำหรับสุนัขที่มีรสชาติเนื้อย่าง ช่วยเพิ่มความอร่อยและพลังงานให้กับสุนัข ตัวขนมมีความนุ่มเหมาะสำหรับสุนัขทุกวัย', 60, 'images (1).jpg', 27, ''),
(64, 'Pedigree Adult Mini อาหารสุนัข', '2', 'อาหารสำเร็จรูปสำหรับสุนัขพันธุ์เล็ก (Mini) สูตรสำหรับสุนัขโต ช่วยดูแลสุขภาพฟัน ขน และระบบย่อยอาหาร พร้อมคุณค่าทางโภชนาการที่เหมาะสม', 200, 'ดาวน์โหลด (10).jpg', 21, ''),
(65, 'Venture แปรงสีฟัน Ultimate Soft (แพ็คคู่)', '1', 'แปรงสีฟันแบบซอฟต์ ที่ช่วยทำความสะอาดฟันได้ดี โดยไม่ทำให้เหงือกหรือฟันเสียหาย เหมาะสำหรับผู้ที่มีปัญหาฟันและเหงือกบอบบาง', 30, 'dsfsdf.jpg', 32, ''),
(66, 'Flexcare แปรงสีฟัน (แพ็คคู่)', '1', 'แปรงสีฟันที่ออกแบบมาเพื่อทำความสะอาดฟันอย่างอ่อนโยนและมีประสิทธิภาพ เหมาะสำหรับการดูแลสุขภาพช่องปาก', 40, 'sfasf.jpg', 22, ''),
(67, 'บริส เพาเวอร์ ผงซักฟอก', '1', 'ผงซักฟอกที่ช่วยขจัดคราบสกปรกได้ดี พร้อมกลิ่นหอมสะอาด เหมาะสำหรับการซักผ้าทุกประเภท', 30, 'p1.jpg', 21, ''),
(68, 'เอสเซ้นซ์ ผงซักฟอกสูตรน้ำหอม', '1', 'ผงซักฟอกที่มีสูตรพิเศษช่วยขจัดคราบได้อย่างมีประสิทธิภาพ พร้อมกลิ่นหอมสดชื่นยาวนาน เหมาะสำหรับการซักผ้าทุกประเภท', 90, 'A1.jpg', 21, ''),
(69, ' Downy น้ำยาปรับผ้านุ่มสูตรสำหรับผ้าขาว', '1', 'น้ำยาปรับผ้านุ่มที่ช่วยให้ผ้าหอมสดชื่นและนุ่มสบาย ช่วยรักษาความสะอาดของผ้าขาวและทำให้ผ้ามีกลิ่นหอมยาวนาน', 80, 'A2.jpg', 14, ''),
(70, 'Whiskas Wet Food for Adult Cats รสปลาทูน่าและปลาแซลมอน', '2', 'อาหารเปียกสำเร็จรูปสำหรับแมวโต รสปลาทูน่าและปลาแซลมอน อุดมไปด้วยสารอาหารที่ช่วยเสริมสร้างระบบภูมิคุ้มกันและสุขภาพที่ดี', 25, 'catt2.png', 30, ''),
(71, 'Whiskas Dry Cat Food รสปลามาการเรล', '2', 'อาหารเม็ดสำเร็จรูปสำหรับแมวโต รสปลามาการเรล อุดมไปด้วยสารอาหารที่ช่วยเสริมสร้างสุขภาพดีให้กับแมว', 150, 'cat1.jpg', 200, ''),
(72, 'Tinkerbell ขนมแมวเลีย ', '2', ' ขนมแมวเลียที่มีหลายรสชาติให้เลือก เช่น รสปลาทูน่า, รสปลาแซลมอน ฯลฯ ช่วยเสริมสร้างร่างกายและให้แมวได้รับความอร่อย', 20, 'caat2.jpg', 20, ''),
(73, 'Me-O Creamy Treats Salmon Flavor', '2', 'ขนมสำหรับแมวรสแซลมอน ที่มี Omega 3 ช่วยเสริมสร้างสุขภาพและความแข็งแรงให้กับแมว', 60, 'catt4.jpg', 25, ''),
(74, 'ข้าวหอมมะลิ 100% ตรา Royal Umbrella (ตราฉัตร)', '4', 'ป็นข้าวหอมมะลิไทย 100% คุณภาพสูง\r\nมีกลิ่นหอม นุ่ม อร่อย\r\nได้รับตรารับรองคุณภาพจากหน่วยงานมาตรฐานอาหาร\r\nเหมาะสำหรับหุงข้าวเพื่อทานคู่กับอาหารไทยทุกชนิด', 300, 'k4.jpg', 30, ''),
(75, 'ข้าวหอมมะลิไทย 100% ตราฉัตรพรีเมียม', '4', 'ข้าวหอมมะลิคุณภาพสูงจากแหล่งปลูกที่ดีที่สุดของไทย เมล็ดข้าวเรียวยาว ขาวสวย หุงขึ้นหม้อ นุ่ม หอม ได้รับการรับรองมาตรฐานคุณภาพ ผลิตและบรรจุด้วยเทคโนโลยีที่ทันสมัยเพื่อคงความสดใหม่ เหมาะสำหรับทุกเมนูอาหารไทย', 350, 'k7.jpg', 26, '');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `products`
--
ALTER TABLE `products`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `products`
--
ALTER TABLE `products`
  MODIFY `id` int(100) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=77;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
